Vekatech/ArduinoCore-renesas/boards.txt
##############################################################

nanor4.name=Arduino Nano R4
nanor4.build.core=arduino
nanor4.build.crossprefix=arm-none-eabi-
nanor4.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

nanor4.build.variant=NANOR4
nanor4.build.mcu=cortex-m4
nanor4.build.architecture=cortex-m4
nanor4.build.fpu=-mfpu=fpv4-sp-d16
nanor4.build.float-abi=-mfloat-abi=hard

nanor4.build.board=nanor4
nanor4.build.defines=-DF_CPU=48000000 -DARDUINO_NANO_R4 -DARDUINO_UNOR4_MINIMA
nanor4.vid.0=0x2341
nanor4.pid.0=0x0074
nanor4.vid.1=0x2341
nanor4.pid.1=0x0374
nanor4.upload_port.0.vid=0x2341
nanor4.upload_port.0.pid=0x0074
nanor4.upload_port.1.vid=0x2341
nanor4.upload_port.1.pid=0x0374

nanor4.compiler.fsp.defines={build.variant.path}/defines.txt
nanor4.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
nanor4.compiler.fsp.cflags=-mthumb "@{compiler.fsp.defines}"
nanor4.compiler.fsp.cxxflags=-mthumb "@{compiler.fsp.defines}"
nanor4.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
nanor4.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
nanor4.compiler.fsp.includes={build.variant.path}/includes.txt
nanor4.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nanor4.compiler.fsp="{build.variant.path}/libs/libfsp.a"

nanor4.upload.tool=dfu-util
nanor4.upload.tool.default=dfu-util
nanor4.upload.protocol=
nanor4.upload.transport=
nanor4.upload.vid=0x2341
nanor4.upload.pid=0x0374
nanor4.upload.address=0x00010000
nanor4.upload.interface=0
nanor4.upload.use_1200bps_touch=false
nanor4.upload.wait_for_upload_port=false
nanor4.upload.native_usb=true
nanor4.upload.maximum_size=262144
nanor4.upload.maximum_data_size=32768

nanor4.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nanor4.debug.server.openocd.scripts.1={programmer.transport_script}
nanor4.debug.server.openocd.scripts.2={runtime.platform.path}/debugger/R7FA4M1AB.cfg
nanor4.debug.svd_file={runtime.platform.path}/svd/R7FA4M1AB.svd

##############################################################

opta_digital.name=Arduino OPTA DIGITAL
opta_digital.build.core=arduino
opta_digital.build.crossprefix=arm-none-eabi-
opta_digital.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

opta_digital.build.variant=OPTA_DIGITAL
opta_digital.build.mcu=cortex-m4
opta_digital.build.architecture=cortex-m4
opta_digital.build.fpu=-mfpu=fpv4-sp-d16
opta_digital.build.float-abi=-mfloat-abi=hard

opta_digital.build.board=OPTA_DIGITAL
opta_digital.build.defines=-DF_CPU=48000000 
opta_digital.vid.0=0x2341
opta_digital.pid.0=0x006E
opta_digital.vid.1=0x2341
opta_digital.pid.1=0x016E
opta_digital.upload_port.0.vid=0x2341
opta_digital.upload_port.0.pid=0x006E
opta_digital.upload_port.1.vid=0x2341
opta_digital.upload_port.1.pid=0x016E

opta_digital.compiler.fsp.defines={build.variant.path}/defines.txt
opta_digital.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
opta_digital.compiler.fsp.cflags=-mthumb "@{compiler.fsp.defines}"
opta_digital.compiler.fsp.cxxflags=-mthumb "@{compiler.fsp.defines}"
opta_digital.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
opta_digital.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
opta_digital.compiler.fsp.includes={build.variant.path}/includes.txt
opta_digital.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
opta_digital.compiler.fsp="{build.variant.path}/libs/libfsp.a"

opta_digital.upload.tool=dfu-util
opta_digital.upload.tool.default=dfu-util
opta_digital.upload.protocol=
opta_digital.upload.transport=
opta_digital.upload.vid=0x2341
opta_digital.upload.pid=0x016E
opta_digital.upload.address=0x00010000
opta_digital.upload.interface=0
opta_digital.upload.use_1200bps_touch=false
opta_digital.upload.wait_for_upload_port=false
opta_digital.upload.native_usb=true
opta_digital.upload.maximum_size=262144
opta_digital.upload.maximum_data_size=32768

##############################################################


opta_analog.name=Arduino OPTA ANALOG
opta_analog.build.core=arduino
opta_analog.build.crossprefix=arm-none-eabi-
opta_analog.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

opta_analog.build.variant=OPTA_ANALOG
opta_analog.build.mcu=cortex-m4
opta_analog.build.architecture=cortex-m4
opta_analog.build.fpu=-mfpu=fpv4-sp-d16
opta_analog.build.float-abi=-mfloat-abi=hard

opta_analog.build.board=OPTA_ANALOG
opta_analog.build.defines=-DF_CPU=48000000 
opta_analog.vid.0=0x2341
opta_analog.pid.0=0x0071
opta_analog.vid.1=0x2341
opta_analog.pid.1=0x0171
opta_analog.upload_port.0.vid=0x2341
opta_analog.upload_port.0.pid=0x0071
opta_analog.upload_port.1.vid=0x2341
opta_analog.upload_port.1.pid=0x0171

opta_analog.compiler.fsp.defines={build.variant.path}/defines.txt
opta_analog.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
opta_analog.compiler.fsp.cflags=-mthumb "@{compiler.fsp.defines}"
opta_analog.compiler.fsp.cxxflags=-mthumb "@{compiler.fsp.defines}"
opta_analog.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
opta_analog.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
opta_analog.compiler.fsp.includes={build.variant.path}/includes.txt
opta_analog.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
opta_analog.compiler.fsp="{build.variant.path}/libs/libfsp.a"

opta_analog.upload.tool=dfu-util
opta_analog.upload.tool.default=dfu-util
opta_analog.upload.protocol=
opta_analog.upload.transport=
opta_analog.upload.vid=0x2341
opta_analog.upload.pid=0x0171
opta_analog.upload.address=0x00010000
opta_analog.upload.interface=0
opta_analog.upload.use_1200bps_touch=false
opta_analog.upload.wait_for_upload_port=false
opta_analog.upload.native_usb=true
opta_analog.upload.maximum_size=262144
opta_analog.upload.maximum_data_size=32768

##############################################################

muxto.name=Science Kit R3 Audio Module
muxto.build.core=arduino
muxto.build.crossprefix=arm-none-eabi-
muxto.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

muxto.build.variant=MUXTO
muxto.build.mcu=cortex-m23
muxto.build.architecture=cortex-m23
muxto.build.fpu=
muxto.build.float-abi=

muxto.build.board=MUXTO
muxto.build.defines=-DF_CPU=48000000 -DFIRST_BULK_PIPE=4 -DNO_ISOCRONOUS_PIPE=1 -DNUMBER_OF_PIPES=8
muxto.vid.0=0x2341
muxto.pid.0=0x006C
muxto.vid.1=0x2341
muxto.pid.1=0x016C
muxto.upload_port.0.vid=0x2341
muxto.upload_port.0.pid=0x006C
muxto.upload_port.1.vid=0x2341
muxto.upload_port.1.pid=0x016C

muxto.compiler.fsp.defines={build.variant.path}/defines.txt
muxto.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
muxto.compiler.fsp.cflags=-mthumb -D_RA_CORE=CM23 -D_RENESAS_RA_
muxto.compiler.fsp.cxxflags=-mthumb -D_RA_CORE=CM23 -D_RENESAS_RA_
muxto.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
muxto.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
muxto.compiler.fsp.includes={build.variant.path}/includes.txt
muxto.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
muxto.compiler.fsp="{build.variant.path}/libs/libfsp.a"

muxto.upload.tool=dfu-util
muxto.upload.tool.default=dfu-util
muxto.upload.protocol=
muxto.upload.transport=
muxto.upload.vid=0x2341
# temporary, recompile bootloader with the right PID
muxto.upload.pid=0x016C
muxto.upload.address=0x00010000
muxto.upload.interface=0
muxto.upload.use_1200bps_touch=false
muxto.upload.wait_for_upload_port=false
muxto.upload.native_usb=true
muxto.upload.maximum_size=262144
muxto.upload.maximum_data_size=32768

